#ifndef LNKMNGR_H
#define LNKMNGR_H

#include "includes.h"
#include "ramdata.h"
#include "mbtypes.h"
////////////////////

typedef
  union TLnkSlotStat { // Byte-addressable UINT
     u16 Stat;
	 struct {
                //////////////////////////////////////////////////////////
	 	unsigned ErrTimeOut:1;   //не дождался ответа
	 	unsigned WaitTimeOut:1;  //ждёт первый байт и считает тайм аут
	 	unsigned FrameEnd:1;     //ждёт завершения пакета
	 	unsigned Skip:1;         //если 1 - то слот пропускается
	 	unsigned NoRespond:1;    //если 1 - то ответа ждать не надо, переход на след. слот
	 	unsigned CRC_Error:1;    //если 1 - данные приняты но в них каша (и такое бывает)
	 	unsigned WaitRespond:1;  //слот в ожидании ответа
	 	unsigned change:1;       //если 1 - верный признак того что нужно его переключить,
                                         //а как переключил - сразу в 0
                /////////////////////////////////////////////////////////
                unsigned DIR_Tougle:1;     //1 - ждёт завершения переключения драйвера (с приёма на передачу или обратно)
	 }bits;
  } TLnkSlotStat;

//слот для организации связи
typedef struct _TLnkSlot_{
  TLnkSlotStat  Status;//состояние слота
  u8 OutCnt;           //сколько байт нужно передать
  u8 InptCnt;          //сколько байт принято
  u16 TimeOut;         //интервал ожидания ответа после которого приходим к выводу об отсутствии связи
  u16 FrameEnd;        //если от последнего байта прошло FrameEnd времени - пакет считается принятым
  u16 DIRTougleTime;   //время переключения драйвера приёмопередатчика
  u8 OutBuf [256];     //массив содержит информацию которую нужно передать
  u8 InBuf  [256];     //массив в который собирается информация от устройства по мере её получения
  void (*OnRead)(void);//процедура которая вызывается после получения ответа от устройства
  TClient *pC;         //указатель на интерфейс вызвавший слот
  u8 _Cnt;             //счётчик отправленных байт
} TLnkSlot;

#endif